Revit 2027 API
BuiltInFailures.SketchFailures.ElementsSketchTooLarge Property
 The sketch defining the highlighted element is too large.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsSketchTooLarge { get; }
Public Shared ReadOnly Property ElementsSketchTooLarge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsSketchTooLarge {
	FailureDefinitionId^ get ();
}
static member ElementsSketchTooLarge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace